# 使用import关键字引入pandas库，为了简便使用缩写 “pd”来表示pandas库。
import pandas as pd

# 使用字典数据类型创建一个数据表，并用pandas库的DataFrame数据结构进行显示
data = {"姓名":["拿破仑","哥德巴赫","秦始皇","凯撒","耶稣"],
        "国家":["地球联盟","黑暗祭祀","地球联盟","黑暗祭祀","地球联盟"],
        "学号":["2019001","2019002","2019003","2019004","2019005"],
        "语文":["33","28","32","30","99"],
        "数学":["98","97","94","92","100"] ,
        "英语":["33","28","32","30","97"],
        "科学":["98","97","94","92","98"],
        "历史":["94","57","96","98","91"]  
}
data_frame = pd.DataFrame(data)
print(data_frame)