# 使用import关键字引入pandas库，为了简便使用缩写 “pd”来表示pandas库。
import pandas as pd

# 使用字典数据类型创建一个数据表，并用pandas库的DataFrame数据结构进行显示
data = {"姓名": ["拿破仑", "哥德巴赫", "秦始皇", "凯撒", "耶稣"],
        "国家": ["地球联盟", "黑暗祭祀", "地球联盟", "黑暗祭祀", "地球联盟"],
        "学号": ["2019001", "2019002", "2019003", "2019004", "2019005"],
        "语文": ["33", "28", "32", "30", "99"],
        "数学": ["98", "97", "94", "92", "100"],
        "英语": ["33", "28", "32", "30", "97"],
        "科学": ["98", "97", "94", "92", "98"],
        "历史": ["94", "57", "96", "98", "91"]
        }
data_frame = pd.DataFrame(data)
print(data_frame)

#
#
# 2. 通过对表格的操作，获得以下几个结果

# (1) 获取国家不等于“地球联盟”的数据
# 使用 “不等于 !=” 操作符排除字段中包含特定值的数据
print(data_frame[data_frame.国家 != "地球联盟"])

# (2) 获取学号等于2019003的数据
print(data_frame[data_frame.学号 == "2019003"])

# (3)获取数学成绩大于95的同学的数据
print(data_frame[data_frame.数学 > "95"])

# (4) 获取历史成绩大于60，同时属于“黑暗祭祀”的同学的信息
print(data_frame[(data_frame.历史 > "60") & (data_frame.国家 == "黑暗祭祀")])
